RT-Thread/rt-thread/bsp/cypress/libraries/IFX_PSOC6_HAL/mtb-hal-cat1/COMPONENT_CAT1A/source/triggers/cyhal_triggers_psoc6_01.c
/***************************************************************************//**
* \file cyhal_triggers_psoc6_01.c
*
* \brief
* PSoC6_01 family HAL triggers header
*
********************************************************************************
* \copyright
* (c) (2016-2022), Cypress Semiconductor Corporation (an Infineon company) or
* an affiliate of Cypress Semiconductor Corporation.
*
* SPDX-License-Identifier: Apache-2.0
*
* Licensed under the Apache License, Version 2.0 (the "License");
* you may not use this file except in compliance with the License.
* You may obtain a copy of the License at
*
*     http://www.apache.org/licenses/LICENSE-2.0
*
* Unless required by applicable law or agreed to in writing, software
* distributed under the License is distributed on an "AS IS" BASIS,
* WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
* See the License for the specific language governing permissions and
* limitations under the License.
*******************************************************************************/

#include "cy_device_headers.h"
#include "cyhal_hw_types.h"

#ifdef CY_DEVICE_PSOC6ABLE2
#include "triggers/cyhal_triggers_psoc6_01.h"

const uint16_t cyhal_sources_per_mux[15] =
{
    51, 51, 43, 43, 43, 43, 43, 43, 43, 33, 33, 97, 29, 34, 38, 
};

const bool cyhal_is_mux_1to1[15] =
{
    false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, 
};

const _cyhal_trigger_source_psoc6_01_t cyhal_mux0_sources[51] =
{
    _CYHAL_TRIGGER_CPUSS_ZERO,
    _CYHAL_TRIGGER_TR_GROUP10_OUTPUT0,
    _CYHAL_TRIGGER_TR_GROUP10_OUTPUT1,
    _CYHAL_TRIGGER_TR_GROUP10_OUTPUT2,
    _CYHAL_TRIGGER_TR_GROUP10_OUTPUT3,
    _CYHAL_TRIGGER_TR_GROUP10_OUTPUT4,
    _CYHAL_TRIGGER_TR_GROUP10_OUTPUT5,
    _CYHAL_TRIGGER_TR_GROUP10_OUTPUT6,
    _CYHAL_TRIGGER_TR_GROUP10_OUTPUT7,
    _CYHAL_TRIGGER_TR_GROUP11_OUTPUT0,
    _CYHAL_TRIGGER_TR_GROUP11_OUTPUT1,
    _CYHAL_TRIGGER_TR_GROUP11_OUTPUT2,
    _CYHAL_TRIGGER_TR_GROUP11_OUTPUT3,
    _CYHAL_TRIGGER_TR_GROUP11_OUTPUT4,
    _CYHAL_TRIGGER_TR_GROUP11_OUTPUT5,
    _CYHAL_TRIGGER_TR_GROUP11_OUTPUT6,
    _CYHAL_TRIGGER_TR_GROUP11_OUTPUT7,
    _CYHAL_TRIGGER_TR_GROUP11_OUTPUT8,
    _CYHAL_TRIGGER_TR_GROUP11_OUTPUT9,
    _CYHAL_TRIGGER_TR_GROUP11_OUTPUT10,
    _CYHAL_TRIGGER_TR_GROUP11_OUTPUT11,
    _CYHAL_TRIGGER_TR_GROUP11_OUTPUT12,
    _CYHAL_TRIGGER_TR_GROUP11_OUTPUT13,
    _CYHAL_TRIGGER_TR_GROUP11_OUTPUT14,
    _CYHAL_TRIGGER_TR_GROUP11_OUTPUT15,
    _CYHAL_TRIGGER_TR_GROUP12_OUTPUT8,
    _CYHAL_TRIGGER_TR_GROUP12_OUTPUT9,
    _CYHAL_TRIGGER_TR_GROUP13_OUTPUT0,
    _CYHAL_TRIGGER_TR_GROUP13_OUTPUT1,
    _CYHAL_TRIGGER_TR_GROUP13_OUTPUT2,
    _CYHAL_TRIGGER_TR_GROUP13_OUTPUT3,
    _CYHAL_TRIGGER_TR_GROUP13_OUTPUT4,
    _CYHAL_TRIGGER_TR_GROUP13_OUTPUT5,
    _CYHAL_TRIGGER_TR_GROUP13_OUTPUT6,
    _CYHAL_TRIGGER_TR_GROUP13_OUTPUT7,
    _CYHAL_TRIGGER_TR_GROUP13_OUTPUT8,
    _CYHAL_TRIGGER_TR_GROUP13_OUTPUT9,
    _CYHAL_TRIGGER_TR_GROUP13_OUTPUT10,
    _CYHAL_TRIGGER_TR_GROUP13_OUTPUT11,
    _CYHAL_TRIGGER_TR_GROUP13_OUTPUT12,
    _CYHAL_TRIGGER_TR_GROUP13_OUTPUT13,
    _CYHAL_TRIGGER_TR_GROUP13_OUTPUT14,
    _CYHAL_TRIGGER_TR_GROUP13_OUTPUT15,
    _CYHAL_TRIGGER_TR_GROUP14_OUTPUT0,
    _CYHAL_TRIGGER_TR_GROUP14_OUTPUT1,
    _CYHAL_TRIGGER_TR_GROUP14_OUTPUT2,
    _CYHAL_TRIGGER_TR_GROUP14_OUTPUT3,
    _CYHAL_TRIGGER_TR_GROUP14_OUTPUT4,
    _CYHAL_TRIGGER_TR_GROUP14_OUTPUT5,
    _CYHAL_TRIGGER_TR_GROUP14_OUTPUT6,
    _CYHAL_TRIGGER_TR_GROUP14_OUTPUT7,
};

const _cyhal_trigger_source_psoc6_01_t cyhal_mux1_sources[51] =
{
    _CYHAL_TRIGGER_CPUSS_ZERO,
    _CYHAL_TRIGGER_TR_GROUP10_OUTPUT0,
    _CYHAL_TRIGGER_TR_GROUP10_OUTPUT1,
    _CYHAL_TRIGGER_TR_GROUP10_OUTPUT2,
    _CYHAL_TRIGGER_TR_GROUP10_OUTPUT3,
    _CYHAL_TRIGGER_TR_GROUP10_OUTPUT4,
    _CYHAL_TRIGGER_TR_GROUP10_OUTPUT5,
    _CYHAL_TRIGGER_TR_GROUP10_OUTPUT6,
    _CYHAL_TRIGGER_TR_GROUP10_OUTPUT7,
    _CYHAL_TRIGGER_TR_GROUP11_OUTPUT0,
    _CYHAL_TRIGGER_TR_GROUP11_OUTPUT1,
    _CYHAL_TRIGGER_TR_GROUP11_OUTPUT2,
    _CYHAL_TRIGGER_TR_GROUP11_OUTPUT3,
    _CYHAL_TRIGGER_TR_GROUP11_OUTPUT4,
    _CYHAL_TRIGGER_TR_GROUP11_OUTPUT5,
    _CYHAL_TRIGGER_TR_GROUP11_OUTPUT6,
    _CYHAL_TRIGGER_TR_GROUP11_OUTPUT7,
    _CYHAL_TRIGGER_TR_GROUP11_OUTPUT8,
    _CYHAL_TRIGGER_TR_GROUP11_OUTPUT9,
    _CYHAL_TRIGGER_TR_GROUP11_OUTPUT10,
    _CYHAL_TRIGGER_TR_GROUP11_OUTPUT11,
    _CYHAL_TRIGGER_TR_GROUP11_OUTPUT12,
    _CYHAL_TRIGGER_TR_GROUP11_OUTPUT13,
    _CYHAL_TRIGGER_TR_GROUP11_OUTPUT14,
    _CYHAL_TRIGGER_TR_GROUP11_OUTPUT15,
    _CYHAL_TRIGGER_TR_GROUP12_OUTPUT8,
    _CYHAL_TRIGGER_TR_GROUP12_OUTPUT9,
    _CYHAL_TRIGGER_TR_GROUP13_OUTPUT0,
    _CYHAL_TRIGGER_TR_GROUP13_OUTPUT1,
    _CYHAL_TRIGGER_TR_GROUP13_OUTPUT2,
    _CYHAL_TRIGGER_TR_GROUP13_OUTPUT3,
    _CYHAL_TRIGGER_TR_GROUP13_OUTPUT4,
    _CYHAL_TRIGGER_TR_GROUP13_OUTPUT5,
    _CYHAL_TRIGGER_TR_GROUP13_OUTPUT6,
    _CYHAL_TRIGGER_TR_GROUP13_OUTPUT7,
    _CYHAL_TRIGGER_TR_GROUP13_OUTPUT8,
    _CYHAL_TRIGGER_TR_GROUP13_OUTPUT9,
    _CYHAL_TRIGGER_TR_GROUP13_OUTPUT10,
    _CYHAL_TRIGGER_TR_GROUP13_OUTPUT11,
    _CYHAL_TRIGGER_TR_GROUP13_OUTPUT12,
    _CYHAL_TRIGGER_TR_GROUP13_OUTPUT13,
    _CYHAL_TRIGGER_TR_GROUP13_OUTPUT14,
    _CYHAL_TRIGGER_TR_GROUP13_OUTPUT15,
    _CYHAL_TRIGGER_TR_GROUP14_OUTPUT0,
    _CYHAL_TRIGGER_TR_GROUP14_OUTPUT1,
    _CYHAL_TRIGGER_TR_GROUP14_OUTPUT2,
    _CYHAL_TRIGGER_TR_GROUP14_OUTPUT3,
    _CYHAL_TRIGGER_TR_GROUP14_OUTPUT4,
    _CYHAL_TRIGGER_TR_GROUP14_OUTPUT5,
    _CYHAL_TRIGGER_TR_GROUP14_OUTPUT6,
    _CYHAL_TRIGGER_TR_GROUP14_OUTPUT7,
};

const _cyhal_trigger_source_psoc6_01_t cyhal_mux2_sources[43] =
{
    _CYHAL_TRIGGER_CPUSS_ZERO,
    _CYHAL_TRIGGER_TR_GROUP10_OUTPUT0,
    _CYHAL_TRIGGER_TR_GROUP10_OUTPUT1,
    _CYHAL_TRIGGER_TR_GROUP10_OUTPUT2,
    _CYHAL_TRIGGER_TR_GROUP10_OUTPUT3,
    _CYHAL_TRIGGER_TR_GROUP10_OUTPUT4,
    _CYHAL_TRIGGER_TR_GROUP10_OUTPUT5,
    _CYHAL_TRIGGER_TR_GROUP10_OUTPUT6,
    _CYHAL_TRIGGER_TR_GROUP10_OUTPUT7,
    _CYHAL_TRIGGER_TR_GROUP11_OUTPUT0,
    _CYHAL_TRIGGER_TR_GROUP11_OUTPUT1,
    _CYHAL_TRIGGER_TR_GROUP11_OUTPUT2,
    _CYHAL_TRIGGER_TR_GROUP11_OUTPUT3,
    _CYHAL_TRIGGER_TR_GROUP11_OUTPUT4,
    _CYHAL_TRIGGER_TR_GROUP11_OUTPUT5,
    _CYHAL_TRIGGER_TR_GROUP11_OUTPUT6,
    _CYHAL_TRIGGER_TR_GROUP11_OUTPUT7,
    _CYHAL_TRIGGER_TR_GROUP11_OUTPUT8,
    _CYHAL_TRIGGER_TR_GROUP11_OUTPUT9,
    _CYHAL_TRIGGER_TR_GROUP11_OUTPUT10,
    _CYHAL_TRIGGER_TR_GROUP11_OUTPUT11,
    _CYHAL_TRIGGER_TR_GROUP11_OUTPUT12,
    _CYHAL_TRIGGER_TR_GROUP11_OUTPUT13,
    _CYHAL_TRIGGER_TR_GROUP11_OUTPUT14,
    _CYHAL_TRIGGER_TR_GROUP11_OUTPUT15,
    _CYHAL_TRIGGER_TR_GROUP12_OUTPUT0,
    _CYHAL_TRIGGER_TR_GROUP12_OUTPUT1,
    _CYHAL_TRIGGER_TR_GROUP12_OUTPUT2,
    _CYHAL_TRIGGER_TR_GROUP12_OUTPUT3,
    _CYHAL_TRIGGER_TR_GROUP12_OUTPUT4,
    _CYHAL_TRIGGER_TR_GROUP12_OUTPUT5,
    _CYHAL_TRIGGER_TR_GROUP12_OUTPUT6,
    _CYHAL_TRIGGER_TR_GROUP12_OUTPUT7,
    _CYHAL_TRIGGER_TR_GROUP13_OUTPUT16,
    _CYHAL_TRIGGER_TR_GROUP13_OUTPUT17,
    _CYHAL_TRIGGER_TR_GROUP14_OUTPUT8,
    _CYHAL_TRIGGER_TR_GROUP14_OUTPUT9,
    _CYHAL_TRIGGER_TR_GROUP14_OUTPUT10,
    _CYHAL_TRIGGER_TR_GROUP14_OUTPUT11,
    _CYHAL_TRIGGER_TR_GROUP14_OUTPUT12,
    _CYHAL_TRIGGER_TR_GROUP14_OUTPUT13,
    _CYHAL_TRIGGER_TR_GROUP14_OUTPUT14,
    _CYHAL_TRIGGER_TR_GROUP14_OUTPUT15,
};

