RT-Thread/rt-thread/bsp/cypress/libraries/IFX_PSOC6_HAL/mtb-hal-cat1/COMPONENT_CAT1A/source/triggers/cyhal_triggers_psoc6_01.c
const _cyhal_trigger_source_psoc6_01_t cyhal_mux3_sources[43] =
{
    _CYHAL_TRIGGER_CPUSS_ZERO,
    _CYHAL_TRIGGER_TR_GROUP10_OUTPUT0,
    _CYHAL_TRIGGER_TR_GROUP10_OUTPUT1,
    _CYHAL_TRIGGER_TR_GROUP10_OUTPUT2,
    _CYHAL_TRIGGER_TR_GROUP10_OUTPUT3,
    _CYHAL_TRIGGER_TR_GROUP10_OUTPUT4,
    _CYHAL_TRIGGER_TR_GROUP10_OUTPUT5,
    _CYHAL_TRIGGER_TR_GROUP10_OUTPUT6,
    _CYHAL_TRIGGER_TR_GROUP10_OUTPUT7,
    _CYHAL_TRIGGER_TR_GROUP11_OUTPUT0,
    _CYHAL_TRIGGER_TR_GROUP11_OUTPUT1,
    _CYHAL_TRIGGER_TR_GROUP11_OUTPUT2,
    _CYHAL_TRIGGER_TR_GROUP11_OUTPUT3,
    _CYHAL_TRIGGER_TR_GROUP11_OUTPUT4,
    _CYHAL_TRIGGER_TR_GROUP11_OUTPUT5,
    _CYHAL_TRIGGER_TR_GROUP11_OUTPUT6,
    _CYHAL_TRIGGER_TR_GROUP11_OUTPUT7,
    _CYHAL_TRIGGER_TR_GROUP11_OUTPUT8,
    _CYHAL_TRIGGER_TR_GROUP11_OUTPUT9,
    _CYHAL_TRIGGER_TR_GROUP11_OUTPUT10,
    _CYHAL_TRIGGER_TR_GROUP11_OUTPUT11,
    _CYHAL_TRIGGER_TR_GROUP11_OUTPUT12,
    _CYHAL_TRIGGER_TR_GROUP11_OUTPUT13,
    _CYHAL_TRIGGER_TR_GROUP11_OUTPUT14,
    _CYHAL_TRIGGER_TR_GROUP11_OUTPUT15,
    _CYHAL_TRIGGER_TR_GROUP12_OUTPUT0,
    _CYHAL_TRIGGER_TR_GROUP12_OUTPUT1,
    _CYHAL_TRIGGER_TR_GROUP12_OUTPUT2,
    _CYHAL_TRIGGER_TR_GROUP12_OUTPUT3,
    _CYHAL_TRIGGER_TR_GROUP12_OUTPUT4,
    _CYHAL_TRIGGER_TR_GROUP12_OUTPUT5,
    _CYHAL_TRIGGER_TR_GROUP12_OUTPUT6,
    _CYHAL_TRIGGER_TR_GROUP12_OUTPUT7,
    _CYHAL_TRIGGER_TR_GROUP13_OUTPUT16,
    _CYHAL_TRIGGER_TR_GROUP13_OUTPUT17,
    _CYHAL_TRIGGER_TR_GROUP14_OUTPUT8,
    _CYHAL_TRIGGER_TR_GROUP14_OUTPUT9,
    _CYHAL_TRIGGER_TR_GROUP14_OUTPUT10,
    _CYHAL_TRIGGER_TR_GROUP14_OUTPUT11,
    _CYHAL_TRIGGER_TR_GROUP14_OUTPUT12,
    _CYHAL_TRIGGER_TR_GROUP14_OUTPUT13,
    _CYHAL_TRIGGER_TR_GROUP14_OUTPUT14,
    _CYHAL_TRIGGER_TR_GROUP14_OUTPUT15,
};

const _cyhal_trigger_source_psoc6_01_t cyhal_mux4_sources[43] =
{
    _CYHAL_TRIGGER_CPUSS_ZERO,
    _CYHAL_TRIGGER_TR_GROUP10_OUTPUT0,
    _CYHAL_TRIGGER_TR_GROUP10_OUTPUT1,
    _CYHAL_TRIGGER_TR_GROUP10_OUTPUT2,
    _CYHAL_TRIGGER_TR_GROUP10_OUTPUT3,
    _CYHAL_TRIGGER_TR_GROUP10_OUTPUT4,
    _CYHAL_TRIGGER_TR_GROUP10_OUTPUT5,
    _CYHAL_TRIGGER_TR_GROUP10_OUTPUT6,
    _CYHAL_TRIGGER_TR_GROUP10_OUTPUT7,
    _CYHAL_TRIGGER_TR_GROUP11_OUTPUT0,
    _CYHAL_TRIGGER_TR_GROUP11_OUTPUT1,
    _CYHAL_TRIGGER_TR_GROUP11_OUTPUT2,
    _CYHAL_TRIGGER_TR_GROUP11_OUTPUT3,
    _CYHAL_TRIGGER_TR_GROUP11_OUTPUT4,
    _CYHAL_TRIGGER_TR_GROUP11_OUTPUT5,
    _CYHAL_TRIGGER_TR_GROUP11_OUTPUT6,
    _CYHAL_TRIGGER_TR_GROUP11_OUTPUT7,
    _CYHAL_TRIGGER_TR_GROUP11_OUTPUT8,
    _CYHAL_TRIGGER_TR_GROUP11_OUTPUT9,
    _CYHAL_TRIGGER_TR_GROUP11_OUTPUT10,
    _CYHAL_TRIGGER_TR_GROUP11_OUTPUT11,
    _CYHAL_TRIGGER_TR_GROUP11_OUTPUT12,
    _CYHAL_TRIGGER_TR_GROUP11_OUTPUT13,
    _CYHAL_TRIGGER_TR_GROUP11_OUTPUT14,
    _CYHAL_TRIGGER_TR_GROUP11_OUTPUT15,
    _CYHAL_TRIGGER_TR_GROUP12_OUTPUT0,
    _CYHAL_TRIGGER_TR_GROUP12_OUTPUT1,
    _CYHAL_TRIGGER_TR_GROUP12_OUTPUT2,
    _CYHAL_TRIGGER_TR_GROUP12_OUTPUT3,
    _CYHAL_TRIGGER_TR_GROUP12_OUTPUT4,
    _CYHAL_TRIGGER_TR_GROUP12_OUTPUT5,
    _CYHAL_TRIGGER_TR_GROUP12_OUTPUT6,
    _CYHAL_TRIGGER_TR_GROUP12_OUTPUT7,
    _CYHAL_TRIGGER_TR_GROUP13_OUTPUT16,
    _CYHAL_TRIGGER_TR_GROUP13_OUTPUT17,
    _CYHAL_TRIGGER_TR_GROUP14_OUTPUT8,
    _CYHAL_TRIGGER_TR_GROUP14_OUTPUT9,
    _CYHAL_TRIGGER_TR_GROUP14_OUTPUT10,
    _CYHAL_TRIGGER_TR_GROUP14_OUTPUT11,
    _CYHAL_TRIGGER_TR_GROUP14_OUTPUT12,
    _CYHAL_TRIGGER_TR_GROUP14_OUTPUT13,
    _CYHAL_TRIGGER_TR_GROUP14_OUTPUT14,
    _CYHAL_TRIGGER_TR_GROUP14_OUTPUT15,
};

const _cyhal_trigger_source_psoc6_01_t cyhal_mux5_sources[43] =
{
    _CYHAL_TRIGGER_CPUSS_ZERO,
    _CYHAL_TRIGGER_TR_GROUP10_OUTPUT0,
    _CYHAL_TRIGGER_TR_GROUP10_OUTPUT1,
    _CYHAL_TRIGGER_TR_GROUP10_OUTPUT2,
    _CYHAL_TRIGGER_TR_GROUP10_OUTPUT3,
    _CYHAL_TRIGGER_TR_GROUP10_OUTPUT4,
    _CYHAL_TRIGGER_TR_GROUP10_OUTPUT5,
    _CYHAL_TRIGGER_TR_GROUP10_OUTPUT6,
    _CYHAL_TRIGGER_TR_GROUP10_OUTPUT7,
    _CYHAL_TRIGGER_TR_GROUP11_OUTPUT0,
    _CYHAL_TRIGGER_TR_GROUP11_OUTPUT1,
    _CYHAL_TRIGGER_TR_GROUP11_OUTPUT2,
    _CYHAL_TRIGGER_TR_GROUP11_OUTPUT3,
    _CYHAL_TRIGGER_TR_GROUP11_OUTPUT4,
    _CYHAL_TRIGGER_TR_GROUP11_OUTPUT5,
    _CYHAL_TRIGGER_TR_GROUP11_OUTPUT6,
    _CYHAL_TRIGGER_TR_GROUP11_OUTPUT7,
    _CYHAL_TRIGGER_TR_GROUP11_OUTPUT8,
    _CYHAL_TRIGGER_TR_GROUP11_OUTPUT9,
    _CYHAL_TRIGGER_TR_GROUP11_OUTPUT10,
    _CYHAL_TRIGGER_TR_GROUP11_OUTPUT11,
    _CYHAL_TRIGGER_TR_GROUP11_OUTPUT12,
    _CYHAL_TRIGGER_TR_GROUP11_OUTPUT13,
    _CYHAL_TRIGGER_TR_GROUP11_OUTPUT14,
    _CYHAL_TRIGGER_TR_GROUP11_OUTPUT15,
    _CYHAL_TRIGGER_TR_GROUP12_OUTPUT0,
    _CYHAL_TRIGGER_TR_GROUP12_OUTPUT1,
    _CYHAL_TRIGGER_TR_GROUP12_OUTPUT2,
    _CYHAL_TRIGGER_TR_GROUP12_OUTPUT3,
    _CYHAL_TRIGGER_TR_GROUP12_OUTPUT4,
    _CYHAL_TRIGGER_TR_GROUP12_OUTPUT5,
    _CYHAL_TRIGGER_TR_GROUP12_OUTPUT6,
    _CYHAL_TRIGGER_TR_GROUP12_OUTPUT7,
    _CYHAL_TRIGGER_TR_GROUP13_OUTPUT16,
    _CYHAL_TRIGGER_TR_GROUP13_OUTPUT17,
    _CYHAL_TRIGGER_TR_GROUP14_OUTPUT8,
    _CYHAL_TRIGGER_TR_GROUP14_OUTPUT9,
    _CYHAL_TRIGGER_TR_GROUP14_OUTPUT10,
    _CYHAL_TRIGGER_TR_GROUP14_OUTPUT11,
    _CYHAL_TRIGGER_TR_GROUP14_OUTPUT12,
    _CYHAL_TRIGGER_TR_GROUP14_OUTPUT13,
    _CYHAL_TRIGGER_TR_GROUP14_OUTPUT14,
    _CYHAL_TRIGGER_TR_GROUP14_OUTPUT15,
};

const _cyhal_trigger_source_psoc6_01_t cyhal_mux6_sources[43] =
{
    _CYHAL_TRIGGER_CPUSS_ZERO,
    _CYHAL_TRIGGER_TR_GROUP10_OUTPUT0,
    _CYHAL_TRIGGER_TR_GROUP10_OUTPUT1,
    _CYHAL_TRIGGER_TR_GROUP10_OUTPUT2,
    _CYHAL_TRIGGER_TR_GROUP10_OUTPUT3,
    _CYHAL_TRIGGER_TR_GROUP10_OUTPUT4,
    _CYHAL_TRIGGER_TR_GROUP10_OUTPUT5,
    _CYHAL_TRIGGER_TR_GROUP10_OUTPUT6,
    _CYHAL_TRIGGER_TR_GROUP10_OUTPUT7,
    _CYHAL_TRIGGER_TR_GROUP11_OUTPUT0,
    _CYHAL_TRIGGER_TR_GROUP11_OUTPUT1,
    _CYHAL_TRIGGER_TR_GROUP11_OUTPUT2,
    _CYHAL_TRIGGER_TR_GROUP11_OUTPUT3,
    _CYHAL_TRIGGER_TR_GROUP11_OUTPUT4,
    _CYHAL_TRIGGER_TR_GROUP11_OUTPUT5,
    _CYHAL_TRIGGER_TR_GROUP11_OUTPUT6,
    _CYHAL_TRIGGER_TR_GROUP11_OUTPUT7,
    _CYHAL_TRIGGER_TR_GROUP11_OUTPUT8,
    _CYHAL_TRIGGER_TR_GROUP11_OUTPUT9,
    _CYHAL_TRIGGER_TR_GROUP11_OUTPUT10,
    _CYHAL_TRIGGER_TR_GROUP11_OUTPUT11,
    _CYHAL_TRIGGER_TR_GROUP11_OUTPUT12,
    _CYHAL_TRIGGER_TR_GROUP11_OUTPUT13,
    _CYHAL_TRIGGER_TR_GROUP11_OUTPUT14,
    _CYHAL_TRIGGER_TR_GROUP11_OUTPUT15,
    _CYHAL_TRIGGER_TR_GROUP12_OUTPUT0,
    _CYHAL_TRIGGER_TR_GROUP12_OUTPUT1,
    _CYHAL_TRIGGER_TR_GROUP12_OUTPUT2,
    _CYHAL_TRIGGER_TR_GROUP12_OUTPUT3,
    _CYHAL_TRIGGER_TR_GROUP12_OUTPUT4,
    _CYHAL_TRIGGER_TR_GROUP12_OUTPUT5,
    _CYHAL_TRIGGER_TR_GROUP12_OUTPUT6,
    _CYHAL_TRIGGER_TR_GROUP12_OUTPUT7,
    _CYHAL_TRIGGER_TR_GROUP13_OUTPUT16,
    _CYHAL_TRIGGER_TR_GROUP13_OUTPUT17,
    _CYHAL_TRIGGER_TR_GROUP14_OUTPUT8,
    _CYHAL_TRIGGER_TR_GROUP14_OUTPUT9,
    _CYHAL_TRIGGER_TR_GROUP14_OUTPUT10,
    _CYHAL_TRIGGER_TR_GROUP14_OUTPUT11,
    _CYHAL_TRIGGER_TR_GROUP14_OUTPUT12,
    _CYHAL_TRIGGER_TR_GROUP14_OUTPUT13,
    _CYHAL_TRIGGER_TR_GROUP14_OUTPUT14,
    _CYHAL_TRIGGER_TR_GROUP14_OUTPUT15,
};

const _cyhal_trigger_source_psoc6_01_t cyhal_mux7_sources[43] =
{
    _CYHAL_TRIGGER_CPUSS_ZERO,
    _CYHAL_TRIGGER_TR_GROUP10_OUTPUT0,
    _CYHAL_TRIGGER_TR_GROUP10_OUTPUT1,
    _CYHAL_TRIGGER_TR_GROUP10_OUTPUT2,
    _CYHAL_TRIGGER_TR_GROUP10_OUTPUT3,
    _CYHAL_TRIGGER_TR_GROUP10_OUTPUT4,
    _CYHAL_TRIGGER_TR_GROUP10_OUTPUT5,
    _CYHAL_TRIGGER_TR_GROUP10_OUTPUT6,
    _CYHAL_TRIGGER_TR_GROUP10_OUTPUT7,
    _CYHAL_TRIGGER_TR_GROUP11_OUTPUT0,
    _CYHAL_TRIGGER_TR_GROUP11_OUTPUT1,
    _CYHAL_TRIGGER_TR_GROUP11_OUTPUT2,
    _CYHAL_TRIGGER_TR_GROUP11_OUTPUT3,
    _CYHAL_TRIGGER_TR_GROUP11_OUTPUT4,
    _CYHAL_TRIGGER_TR_GROUP11_OUTPUT5,
    _CYHAL_TRIGGER_TR_GROUP11_OUTPUT6,
    _CYHAL_TRIGGER_TR_GROUP11_OUTPUT7,
    _CYHAL_TRIGGER_TR_GROUP11_OUTPUT8,
    _CYHAL_TRIGGER_TR_GROUP11_OUTPUT9,
    _CYHAL_TRIGGER_TR_GROUP11_OUTPUT10,
    _CYHAL_TRIGGER_TR_GROUP11_OUTPUT11,
    _CYHAL_TRIGGER_TR_GROUP11_OUTPUT12,
    _CYHAL_TRIGGER_TR_GROUP11_OUTPUT13,
    _CYHAL_TRIGGER_TR_GROUP11_OUTPUT14,
    _CYHAL_TRIGGER_TR_GROUP11_OUTPUT15,
    _CYHAL_TRIGGER_TR_GROUP12_OUTPUT0,
    _CYHAL_TRIGGER_TR_GROUP12_OUTPUT1,
    _CYHAL_TRIGGER_TR_GROUP12_OUTPUT2,
    _CYHAL_TRIGGER_TR_GROUP12_OUTPUT3,
    _CYHAL_TRIGGER_TR_GROUP12_OUTPUT4,
    _CYHAL_TRIGGER_TR_GROUP12_OUTPUT5,
    _CYHAL_TRIGGER_TR_GROUP12_OUTPUT6,
    _CYHAL_TRIGGER_TR_GROUP12_OUTPUT7,
    _CYHAL_TRIGGER_TR_GROUP13_OUTPUT16,
    _CYHAL_TRIGGER_TR_GROUP13_OUTPUT17,
    _CYHAL_TRIGGER_TR_GROUP14_OUTPUT8,
    _CYHAL_TRIGGER_TR_GROUP14_OUTPUT9,
    _CYHAL_TRIGGER_TR_GROUP14_OUTPUT10,
    _CYHAL_TRIGGER_TR_GROUP14_OUTPUT11,
    _CYHAL_TRIGGER_TR_GROUP14_OUTPUT12,
    _CYHAL_TRIGGER_TR_GROUP14_OUTPUT13,
    _CYHAL_TRIGGER_TR_GROUP14_OUTPUT14,
    _CYHAL_TRIGGER_TR_GROUP14_OUTPUT15,
};

const _cyhal_trigger_source_psoc6_01_t cyhal_mux8_sources[43] =
{
    _CYHAL_TRIGGER_CPUSS_ZERO,
    _CYHAL_TRIGGER_TR_GROUP10_OUTPUT0,
    _CYHAL_TRIGGER_TR_GROUP10_OUTPUT1,
    _CYHAL_TRIGGER_TR_GROUP10_OUTPUT2,
    _CYHAL_TRIGGER_TR_GROUP10_OUTPUT3,
    _CYHAL_TRIGGER_TR_GROUP10_OUTPUT4,
    _CYHAL_TRIGGER_TR_GROUP10_OUTPUT5,
    _CYHAL_TRIGGER_TR_GROUP10_OUTPUT6,
    _CYHAL_TRIGGER_TR_GROUP10_OUTPUT7,
    _CYHAL_TRIGGER_TR_GROUP11_OUTPUT0,
    _CYHAL_TRIGGER_TR_GROUP11_OUTPUT1,
    _CYHAL_TRIGGER_TR_GROUP11_OUTPUT2,
    _CYHAL_TRIGGER_TR_GROUP11_OUTPUT3,
    _CYHAL_TRIGGER_TR_GROUP11_OUTPUT4,
    _CYHAL_TRIGGER_TR_GROUP11_OUTPUT5,
    _CYHAL_TRIGGER_TR_GROUP11_OUTPUT6,
    _CYHAL_TRIGGER_TR_GROUP11_OUTPUT7,
    _CYHAL_TRIGGER_TR_GROUP11_OUTPUT8,
    _CYHAL_TRIGGER_TR_GROUP11_OUTPUT9,
    _CYHAL_TRIGGER_TR_GROUP11_OUTPUT10,
    _CYHAL_TRIGGER_TR_GROUP11_OUTPUT11,
    _CYHAL_TRIGGER_TR_GROUP11_OUTPUT12,
    _CYHAL_TRIGGER_TR_GROUP11_OUTPUT13,
    _CYHAL_TRIGGER_TR_GROUP11_OUTPUT14,
    _CYHAL_TRIGGER_TR_GROUP11_OUTPUT15,
    _CYHAL_TRIGGER_TR_GROUP12_OUTPUT0,
    _CYHAL_TRIGGER_TR_GROUP12_OUTPUT1,
    _CYHAL_TRIGGER_TR_GROUP12_OUTPUT2,
    _CYHAL_TRIGGER_TR_GROUP12_OUTPUT3,
    _CYHAL_TRIGGER_TR_GROUP12_OUTPUT4,
    _CYHAL_TRIGGER_TR_GROUP12_OUTPUT5,
    _CYHAL_TRIGGER_TR_GROUP12_OUTPUT6,
    _CYHAL_TRIGGER_TR_GROUP12_OUTPUT7,
    _CYHAL_TRIGGER_TR_GROUP13_OUTPUT16,
    _CYHAL_TRIGGER_TR_GROUP13_OUTPUT17,
    _CYHAL_TRIGGER_TR_GROUP14_OUTPUT8,
    _CYHAL_TRIGGER_TR_GROUP14_OUTPUT9,
    _CYHAL_TRIGGER_TR_GROUP14_OUTPUT10,
    _CYHAL_TRIGGER_TR_GROUP14_OUTPUT11,
    _CYHAL_TRIGGER_TR_GROUP14_OUTPUT12,
    _CYHAL_TRIGGER_TR_GROUP14_OUTPUT13,
    _CYHAL_TRIGGER_TR_GROUP14_OUTPUT14,
    _CYHAL_TRIGGER_TR_GROUP14_OUTPUT15,
};

const _cyhal_trigger_source_psoc6_01_t cyhal_mux9_sources[33] =
{
    _CYHAL_TRIGGER_CPUSS_ZERO,
    _CYHAL_TRIGGER_CPUSS_DW0_TR_OUT0,
    _CYHAL_TRIGGER_CPUSS_DW0_TR_OUT1,
    _CYHAL_TRIGGER_CPUSS_DW0_TR_OUT2,
    _CYHAL_TRIGGER_CPUSS_DW0_TR_OUT3,
    _CYHAL_TRIGGER_CPUSS_DW0_TR_OUT4,
    _CYHAL_TRIGGER_CPUSS_DW0_TR_OUT5,
    _CYHAL_TRIGGER_CPUSS_DW0_TR_OUT6,
    _CYHAL_TRIGGER_CPUSS_DW0_TR_OUT7,
    _CYHAL_TRIGGER_CPUSS_DW0_TR_OUT8,
    _CYHAL_TRIGGER_CPUSS_DW0_TR_OUT9,
    _CYHAL_TRIGGER_CPUSS_DW0_TR_OUT10,
    _CYHAL_TRIGGER_CPUSS_DW0_TR_OUT11,
    _CYHAL_TRIGGER_CPUSS_DW0_TR_OUT12,
    _CYHAL_TRIGGER_CPUSS_DW0_TR_OUT13,
    _CYHAL_TRIGGER_CPUSS_DW0_TR_OUT14,
    _CYHAL_TRIGGER_CPUSS_DW0_TR_OUT15,
    _CYHAL_TRIGGER_CPUSS_DW1_TR_OUT0,
    _CYHAL_TRIGGER_CPUSS_DW1_TR_OUT1,
    _CYHAL_TRIGGER_CPUSS_DW1_TR_OUT2,
    _CYHAL_TRIGGER_CPUSS_DW1_TR_OUT3,
    _CYHAL_TRIGGER_CPUSS_DW1_TR_OUT4,
    _CYHAL_TRIGGER_CPUSS_DW1_TR_OUT5,
    _CYHAL_TRIGGER_CPUSS_DW1_TR_OUT6,
    _CYHAL_TRIGGER_CPUSS_DW1_TR_OUT7,
    _CYHAL_TRIGGER_CPUSS_DW1_TR_OUT8,
    _CYHAL_TRIGGER_CPUSS_DW1_TR_OUT9,
    _CYHAL_TRIGGER_CPUSS_DW1_TR_OUT10,
    _CYHAL_TRIGGER_CPUSS_DW1_TR_OUT11,
    _CYHAL_TRIGGER_CPUSS_DW1_TR_OUT12,
    _CYHAL_TRIGGER_CPUSS_DW1_TR_OUT13,
    _CYHAL_TRIGGER_CPUSS_DW1_TR_OUT14,
    _CYHAL_TRIGGER_CPUSS_DW1_TR_OUT15,
};

