RT-Thread/rt-thread/bsp/cypress/libraries/IFX_PSOC6_HAL/mtb-hal-cat1/COMPONENT_CAT1A/source/triggers/cyhal_triggers_psoc6_01.c
const _cyhal_trigger_source_psoc6_01_t cyhal_mux13_sources[34] =
{
    _CYHAL_TRIGGER_CPUSS_ZERO,
    _CYHAL_TRIGGER_SCB0_TR_TX_REQ,
    _CYHAL_TRIGGER_SCB0_TR_RX_REQ,
    _CYHAL_TRIGGER_SCB1_TR_TX_REQ,
    _CYHAL_TRIGGER_SCB1_TR_RX_REQ,
    _CYHAL_TRIGGER_SCB2_TR_TX_REQ,
    _CYHAL_TRIGGER_SCB2_TR_RX_REQ,
    _CYHAL_TRIGGER_SCB3_TR_TX_REQ,
    _CYHAL_TRIGGER_SCB3_TR_RX_REQ,
    _CYHAL_TRIGGER_SCB4_TR_TX_REQ,
    _CYHAL_TRIGGER_SCB4_TR_RX_REQ,
    _CYHAL_TRIGGER_SCB5_TR_TX_REQ,
    _CYHAL_TRIGGER_SCB5_TR_RX_REQ,
    _CYHAL_TRIGGER_SCB6_TR_TX_REQ,
    _CYHAL_TRIGGER_SCB6_TR_RX_REQ,
    _CYHAL_TRIGGER_SCB7_TR_TX_REQ,
    _CYHAL_TRIGGER_SCB7_TR_RX_REQ,
    _CYHAL_TRIGGER_SCB8_TR_TX_REQ,
    _CYHAL_TRIGGER_SCB8_TR_RX_REQ,
    _CYHAL_TRIGGER_AUDIOSS_TR_PDM_RX_REQ,
    _CYHAL_TRIGGER_AUDIOSS_TR_I2S_TX_REQ,
    _CYHAL_TRIGGER_AUDIOSS_TR_I2S_RX_REQ,
    _CYHAL_TRIGGER_SMIF_TR_TX_REQ,
    _CYHAL_TRIGGER_SMIF_TR_RX_REQ,
    _CYHAL_TRIGGER_USB_DMA_REQ0,
    _CYHAL_TRIGGER_USB_DMA_REQ1,
    _CYHAL_TRIGGER_USB_DMA_REQ2,
    _CYHAL_TRIGGER_USB_DMA_REQ3,
    _CYHAL_TRIGGER_USB_DMA_REQ4,
    _CYHAL_TRIGGER_USB_DMA_REQ5,
    _CYHAL_TRIGGER_USB_DMA_REQ6,
    _CYHAL_TRIGGER_USB_DMA_REQ7,
    _CYHAL_TRIGGER_CSD_TR_ADC_DONE,
    _CYHAL_TRIGGER_CSD_DSI_SENSE_OUT,
};

const _cyhal_trigger_source_psoc6_01_t cyhal_mux14_sources[38] =
{
    _CYHAL_TRIGGER_CPUSS_ZERO,
    _CYHAL_TRIGGER_UDB_TR_UDB0,
    _CYHAL_TRIGGER_UDB_TR_UDB1,
    _CYHAL_TRIGGER_UDB_TR_UDB2,
    _CYHAL_TRIGGER_UDB_TR_UDB3,
    _CYHAL_TRIGGER_UDB_TR_UDB4,
    _CYHAL_TRIGGER_UDB_TR_UDB5,
    _CYHAL_TRIGGER_UDB_TR_UDB6,
    _CYHAL_TRIGGER_UDB_TR_UDB7,
    _CYHAL_TRIGGER_UDB_TR_UDB8,
    _CYHAL_TRIGGER_UDB_TR_UDB9,
    _CYHAL_TRIGGER_UDB_TR_UDB10,
    _CYHAL_TRIGGER_UDB_TR_UDB11,
    _CYHAL_TRIGGER_UDB_TR_UDB12,
    _CYHAL_TRIGGER_UDB_TR_UDB13,
    _CYHAL_TRIGGER_UDB_TR_UDB14,
    _CYHAL_TRIGGER_UDB_TR_UDB15,
    _CYHAL_TRIGGER_UDB_DSI_OUT_TR0,
    _CYHAL_TRIGGER_UDB_DSI_OUT_TR1,
    _CYHAL_TRIGGER_CPUSS_CTI_TR_OUT0,
    _CYHAL_TRIGGER_CPUSS_CTI_TR_OUT1,
    _CYHAL_TRIGGER_PASS_TR_SAR_OUT,
    _CYHAL_TRIGGER_PASS_TR_CTDAC_EMPTY,
    _CYHAL_TRIGGER_PASS_DSI_CTB_CMP0,
    _CYHAL_TRIGGER_PASS_DSI_CTB_CMP1,
    _CYHAL_TRIGGER_LPCOMP_DSI_COMP0,
    _CYHAL_TRIGGER_LPCOMP_DSI_COMP1,
    _CYHAL_TRIGGER_SCB0_TR_I2C_SCL_FILTERED,
    _CYHAL_TRIGGER_SCB1_TR_I2C_SCL_FILTERED,
    _CYHAL_TRIGGER_SCB2_TR_I2C_SCL_FILTERED,
    _CYHAL_TRIGGER_SCB3_TR_I2C_SCL_FILTERED,
    _CYHAL_TRIGGER_SCB4_TR_I2C_SCL_FILTERED,
    _CYHAL_TRIGGER_SCB5_TR_I2C_SCL_FILTERED,
    _CYHAL_TRIGGER_SCB6_TR_I2C_SCL_FILTERED,
    _CYHAL_TRIGGER_SCB7_TR_I2C_SCL_FILTERED,
    _CYHAL_TRIGGER_SCB8_TR_I2C_SCL_FILTERED,
    _CYHAL_TRIGGER_CPUSS_TR_FAULT0,
    _CYHAL_TRIGGER_CPUSS_TR_FAULT1,
};

const _cyhal_trigger_source_psoc6_01_t* cyhal_mux_to_sources[15] =
{
    cyhal_mux0_sources, 
    cyhal_mux1_sources, 
    cyhal_mux2_sources, 
    cyhal_mux3_sources, 
    cyhal_mux4_sources, 
    cyhal_mux5_sources, 
    cyhal_mux6_sources, 
    cyhal_mux7_sources, 
    cyhal_mux8_sources, 
    cyhal_mux9_sources, 
    cyhal_mux10_sources, 
    cyhal_mux11_sources, 
    cyhal_mux12_sources, 
    cyhal_mux13_sources, 
    cyhal_mux14_sources, 
};

const uint8_t cyhal_dest_to_mux[479] =
{
    5, /* CYHAL_TRIGGER_CPUSS_CTI_TR_IN0 */
    5, /* CYHAL_TRIGGER_CPUSS_CTI_TR_IN1 */
    0, /* CYHAL_TRIGGER_CPUSS_DW0_TR_IN0 */
    0, /* CYHAL_TRIGGER_CPUSS_DW0_TR_IN1 */
    0, /* CYHAL_TRIGGER_CPUSS_DW0_TR_IN2 */
    0, /* CYHAL_TRIGGER_CPUSS_DW0_TR_IN3 */
    0, /* CYHAL_TRIGGER_CPUSS_DW0_TR_IN4 */
    0, /* CYHAL_TRIGGER_CPUSS_DW0_TR_IN5 */
    0, /* CYHAL_TRIGGER_CPUSS_DW0_TR_IN6 */
    0, /* CYHAL_TRIGGER_CPUSS_DW0_TR_IN7 */
    0, /* CYHAL_TRIGGER_CPUSS_DW0_TR_IN8 */
    0, /* CYHAL_TRIGGER_CPUSS_DW0_TR_IN9 */
    0, /* CYHAL_TRIGGER_CPUSS_DW0_TR_IN10 */
    0, /* CYHAL_TRIGGER_CPUSS_DW0_TR_IN11 */
    0, /* CYHAL_TRIGGER_CPUSS_DW0_TR_IN12 */
    0, /* CYHAL_TRIGGER_CPUSS_DW0_TR_IN13 */
    0, /* CYHAL_TRIGGER_CPUSS_DW0_TR_IN14 */
    0, /* CYHAL_TRIGGER_CPUSS_DW0_TR_IN15 */
    1, /* CYHAL_TRIGGER_CPUSS_DW1_TR_IN0 */
    1, /* CYHAL_TRIGGER_CPUSS_DW1_TR_IN1 */
    1, /* CYHAL_TRIGGER_CPUSS_DW1_TR_IN2 */
    1, /* CYHAL_TRIGGER_CPUSS_DW1_TR_IN3 */
    1, /* CYHAL_TRIGGER_CPUSS_DW1_TR_IN4 */
    1, /* CYHAL_TRIGGER_CPUSS_DW1_TR_IN5 */
    1, /* CYHAL_TRIGGER_CPUSS_DW1_TR_IN6 */
    1, /* CYHAL_TRIGGER_CPUSS_DW1_TR_IN7 */
    1, /* CYHAL_TRIGGER_CPUSS_DW1_TR_IN8 */
    1, /* CYHAL_TRIGGER_CPUSS_DW1_TR_IN9 */
    1, /* CYHAL_TRIGGER_CPUSS_DW1_TR_IN10 */
    1, /* CYHAL_TRIGGER_CPUSS_DW1_TR_IN11 */
    1, /* CYHAL_TRIGGER_CPUSS_DW1_TR_IN12 */
    1, /* CYHAL_TRIGGER_CPUSS_DW1_TR_IN13 */
    1, /* CYHAL_TRIGGER_CPUSS_DW1_TR_IN14 */
    1, /* CYHAL_TRIGGER_CPUSS_DW1_TR_IN15 */
    6, /* CYHAL_TRIGGER_PASS_TR_SAR_IN */
    8, /* CYHAL_TRIGGER_PERI_TR_IO_OUTPUT0 */
    8, /* CYHAL_TRIGGER_PERI_TR_IO_OUTPUT1 */
    4, /* CYHAL_TRIGGER_PROFILE_TR_START */
    4, /* CYHAL_TRIGGER_PROFILE_TR_STOP */
    2, /* CYHAL_TRIGGER_TCPWM0_TR_IN0 */
    2, /* CYHAL_TRIGGER_TCPWM0_TR_IN1 */
    2, /* CYHAL_TRIGGER_TCPWM0_TR_IN2 */
    2, /* CYHAL_TRIGGER_TCPWM0_TR_IN3 */
    2, /* CYHAL_TRIGGER_TCPWM0_TR_IN4 */
    2, /* CYHAL_TRIGGER_TCPWM0_TR_IN5 */
    2, /* CYHAL_TRIGGER_TCPWM0_TR_IN6 */
    2, /* CYHAL_TRIGGER_TCPWM0_TR_IN7 */
    2, /* CYHAL_TRIGGER_TCPWM0_TR_IN8 */
    2, /* CYHAL_TRIGGER_TCPWM0_TR_IN9 */
    2, /* CYHAL_TRIGGER_TCPWM0_TR_IN10 */
    2, /* CYHAL_TRIGGER_TCPWM0_TR_IN11 */
    2, /* CYHAL_TRIGGER_TCPWM0_TR_IN12 */
    2, /* CYHAL_TRIGGER_TCPWM0_TR_IN13 */
    3, /* CYHAL_TRIGGER_TCPWM1_TR_IN0 */
    3, /* CYHAL_TRIGGER_TCPWM1_TR_IN1 */
    3, /* CYHAL_TRIGGER_TCPWM1_TR_IN2 */
    3, /* CYHAL_TRIGGER_TCPWM1_TR_IN3 */
    3, /* CYHAL_TRIGGER_TCPWM1_TR_IN4 */
    3, /* CYHAL_TRIGGER_TCPWM1_TR_IN5 */
    3, /* CYHAL_TRIGGER_TCPWM1_TR_IN6 */
    3, /* CYHAL_TRIGGER_TCPWM1_TR_IN7 */
    3, /* CYHAL_TRIGGER_TCPWM1_TR_IN8 */
    3, /* CYHAL_TRIGGER_TCPWM1_TR_IN9 */
    3, /* CYHAL_TRIGGER_TCPWM1_TR_IN10 */
    3, /* CYHAL_TRIGGER_TCPWM1_TR_IN11 */
    3, /* CYHAL_TRIGGER_TCPWM1_TR_IN12 */
    3, /* CYHAL_TRIGGER_TCPWM1_TR_IN13 */
    10, /* CYHAL_TRIGGER_TR_GROUP0_INPUT1 */
    10, /* CYHAL_TRIGGER_TR_GROUP0_INPUT2 */
    10, /* CYHAL_TRIGGER_TR_GROUP0_INPUT3 */
    10, /* CYHAL_TRIGGER_TR_GROUP0_INPUT4 */
    10, /* CYHAL_TRIGGER_TR_GROUP0_INPUT5 */
    10, /* CYHAL_TRIGGER_TR_GROUP0_INPUT6 */
    10, /* CYHAL_TRIGGER_TR_GROUP0_INPUT7 */
    10, /* CYHAL_TRIGGER_TR_GROUP0_INPUT8 */
    11, /* CYHAL_TRIGGER_TR_GROUP0_INPUT9 */
    11, /* CYHAL_TRIGGER_TR_GROUP0_INPUT10 */
    11, /* CYHAL_TRIGGER_TR_GROUP0_INPUT11 */
    11, /* CYHAL_TRIGGER_TR_GROUP0_INPUT12 */
    11, /* CYHAL_TRIGGER_TR_GROUP0_INPUT13 */
    11, /* CYHAL_TRIGGER_TR_GROUP0_INPUT14 */
    11, /* CYHAL_TRIGGER_TR_GROUP0_INPUT15 */
    11, /* CYHAL_TRIGGER_TR_GROUP0_INPUT16 */
    11, /* CYHAL_TRIGGER_TR_GROUP0_INPUT17 */
    11, /* CYHAL_TRIGGER_TR_GROUP0_INPUT18 */
    11, /* CYHAL_TRIGGER_TR_GROUP0_INPUT19 */
    11, /* CYHAL_TRIGGER_TR_GROUP0_INPUT20 */
    11, /* CYHAL_TRIGGER_TR_GROUP0_INPUT21 */
    11, /* CYHAL_TRIGGER_TR_GROUP0_INPUT22 */
    11, /* CYHAL_TRIGGER_TR_GROUP0_INPUT23 */
    11, /* CYHAL_TRIGGER_TR_GROUP0_INPUT24 */
    12, /* CYHAL_TRIGGER_TR_GROUP0_INPUT25 */
    12, /* CYHAL_TRIGGER_TR_GROUP0_INPUT26 */
    13, /* CYHAL_TRIGGER_TR_GROUP0_INPUT27 */
    13, /* CYHAL_TRIGGER_TR_GROUP0_INPUT28 */
    13, /* CYHAL_TRIGGER_TR_GROUP0_INPUT29 */
    13, /* CYHAL_TRIGGER_TR_GROUP0_INPUT30 */
    13, /* CYHAL_TRIGGER_TR_GROUP0_INPUT31 */
    13, /* CYHAL_TRIGGER_TR_GROUP0_INPUT32 */
    13, /* CYHAL_TRIGGER_TR_GROUP0_INPUT33 */
    13, /* CYHAL_TRIGGER_TR_GROUP0_INPUT34 */
    13, /* CYHAL_TRIGGER_TR_GROUP0_INPUT35 */
    13, /* CYHAL_TRIGGER_TR_GROUP0_INPUT36 */
    13, /* CYHAL_TRIGGER_TR_GROUP0_INPUT37 */
    13, /* CYHAL_TRIGGER_TR_GROUP0_INPUT38 */
    13, /* CYHAL_TRIGGER_TR_GROUP0_INPUT39 */
    13, /* CYHAL_TRIGGER_TR_GROUP0_INPUT40 */
    13, /* CYHAL_TRIGGER_TR_GROUP0_INPUT41 */
    13, /* CYHAL_TRIGGER_TR_GROUP0_INPUT42 */
    14, /* CYHAL_TRIGGER_TR_GROUP0_INPUT43 */
    14, /* CYHAL_TRIGGER_TR_GROUP0_INPUT44 */
    14, /* CYHAL_TRIGGER_TR_GROUP0_INPUT45 */
    14, /* CYHAL_TRIGGER_TR_GROUP0_INPUT46 */
    14, /* CYHAL_TRIGGER_TR_GROUP0_INPUT47 */
    14, /* CYHAL_TRIGGER_TR_GROUP0_INPUT48 */
    14, /* CYHAL_TRIGGER_TR_GROUP0_INPUT49 */
    14, /* CYHAL_TRIGGER_TR_GROUP0_INPUT50 */
    10, /* CYHAL_TRIGGER_TR_GROUP1_INPUT1 */
    10, /* CYHAL_TRIGGER_TR_GROUP1_INPUT2 */
    10, /* CYHAL_TRIGGER_TR_GROUP1_INPUT3 */
    10, /* CYHAL_TRIGGER_TR_GROUP1_INPUT4 */
    10, /* CYHAL_TRIGGER_TR_GROUP1_INPUT5 */
    10, /* CYHAL_TRIGGER_TR_GROUP1_INPUT6 */
    10, /* CYHAL_TRIGGER_TR_GROUP1_INPUT7 */
    10, /* CYHAL_TRIGGER_TR_GROUP1_INPUT8 */
    11, /* CYHAL_TRIGGER_TR_GROUP1_INPUT9 */
    11, /* CYHAL_TRIGGER_TR_GROUP1_INPUT10 */
    11, /* CYHAL_TRIGGER_TR_GROUP1_INPUT11 */
    11, /* CYHAL_TRIGGER_TR_GROUP1_INPUT12 */
    11, /* CYHAL_TRIGGER_TR_GROUP1_INPUT13 */
    11, /* CYHAL_TRIGGER_TR_GROUP1_INPUT14 */
    11, /* CYHAL_TRIGGER_TR_GROUP1_INPUT15 */
    11, /* CYHAL_TRIGGER_TR_GROUP1_INPUT16 */
    11, /* CYHAL_TRIGGER_TR_GROUP1_INPUT17 */
    11, /* CYHAL_TRIGGER_TR_GROUP1_INPUT18 */
    11, /* CYHAL_TRIGGER_TR_GROUP1_INPUT19 */
    11, /* CYHAL_TRIGGER_TR_GROUP1_INPUT20 */
    11, /* CYHAL_TRIGGER_TR_GROUP1_INPUT21 */
    11, /* CYHAL_TRIGGER_TR_GROUP1_INPUT22 */
    11, /* CYHAL_TRIGGER_TR_GROUP1_INPUT23 */
    11, /* CYHAL_TRIGGER_TR_GROUP1_INPUT24 */
    12, /* CYHAL_TRIGGER_TR_GROUP1_INPUT25 */
    12, /* CYHAL_TRIGGER_TR_GROUP1_INPUT26 */
    13, /* CYHAL_TRIGGER_TR_GROUP1_INPUT27 */
    13, /* CYHAL_TRIGGER_TR_GROUP1_INPUT28 */
    13, /* CYHAL_TRIGGER_TR_GROUP1_INPUT29 */
    13, /* CYHAL_TRIGGER_TR_GROUP1_INPUT30 */
    13, /* CYHAL_TRIGGER_TR_GROUP1_INPUT31 */
    13, /* CYHAL_TRIGGER_TR_GROUP1_INPUT32 */
    13, /* CYHAL_TRIGGER_TR_GROUP1_INPUT33 */
    13, /* CYHAL_TRIGGER_TR_GROUP1_INPUT34 */
    13, /* CYHAL_TRIGGER_TR_GROUP1_INPUT35 */
    13, /* CYHAL_TRIGGER_TR_GROUP1_INPUT36 */
    13, /* CYHAL_TRIGGER_TR_GROUP1_INPUT37 */
    13, /* CYHAL_TRIGGER_TR_GROUP1_INPUT38 */
    13, /* CYHAL_TRIGGER_TR_GROUP1_INPUT39 */
    13, /* CYHAL_TRIGGER_TR_GROUP1_INPUT40 */
    13, /* CYHAL_TRIGGER_TR_GROUP1_INPUT41 */
    13, /* CYHAL_TRIGGER_TR_GROUP1_INPUT42 */
    14, /* CYHAL_TRIGGER_TR_GROUP1_INPUT43 */
    14, /* CYHAL_TRIGGER_TR_GROUP1_INPUT44 */
    14, /* CYHAL_TRIGGER_TR_GROUP1_INPUT45 */
    14, /* CYHAL_TRIGGER_TR_GROUP1_INPUT46 */
    14, /* CYHAL_TRIGGER_TR_GROUP1_INPUT47 */
    14, /* CYHAL_TRIGGER_TR_GROUP1_INPUT48 */
    14, /* CYHAL_TRIGGER_TR_GROUP1_INPUT49 */
    14, /* CYHAL_TRIGGER_TR_GROUP1_INPUT50 */
    10, /* CYHAL_TRIGGER_TR_GROUP2_INPUT1 */
    10, /* CYHAL_TRIGGER_TR_GROUP2_INPUT2 */
    10, /* CYHAL_TRIGGER_TR_GROUP2_INPUT3 */
    10, /* CYHAL_TRIGGER_TR_GROUP2_INPUT4 */
    10, /* CYHAL_TRIGGER_TR_GROUP2_INPUT5 */
    10, /* CYHAL_TRIGGER_TR_GROUP2_INPUT6 */
    10, /* CYHAL_TRIGGER_TR_GROUP2_INPUT7 */
    10, /* CYHAL_TRIGGER_TR_GROUP2_INPUT8 */
    11, /* CYHAL_TRIGGER_TR_GROUP2_INPUT9 */
    11, /* CYHAL_TRIGGER_TR_GROUP2_INPUT10 */
    11, /* CYHAL_TRIGGER_TR_GROUP2_INPUT11 */
    11, /* CYHAL_TRIGGER_TR_GROUP2_INPUT12 */
    11, /* CYHAL_TRIGGER_TR_GROUP2_INPUT13 */
    11, /* CYHAL_TRIGGER_TR_GROUP2_INPUT14 */
    11, /* CYHAL_TRIGGER_TR_GROUP2_INPUT15 */
    11, /* CYHAL_TRIGGER_TR_GROUP2_INPUT16 */
    11, /* CYHAL_TRIGGER_TR_GROUP2_INPUT17 */
    11, /* CYHAL_TRIGGER_TR_GROUP2_INPUT18 */
    11, /* CYHAL_TRIGGER_TR_GROUP2_INPUT19 */
    11, /* CYHAL_TRIGGER_TR_GROUP2_INPUT20 */
    11, /* CYHAL_TRIGGER_TR_GROUP2_INPUT21 */
    11, /* CYHAL_TRIGGER_TR_GROUP2_INPUT22 */
    11, /* CYHAL_TRIGGER_TR_GROUP2_INPUT23 */
    11, /* CYHAL_TRIGGER_TR_GROUP2_INPUT24 */
    12, /* CYHAL_TRIGGER_TR_GROUP2_INPUT25 */
    12, /* CYHAL_TRIGGER_TR_GROUP2_INPUT26 */
    12, /* CYHAL_TRIGGER_TR_GROUP2_INPUT27 */
    12, /* CYHAL_TRIGGER_TR_GROUP2_INPUT28 */
    12, /* CYHAL_TRIGGER_TR_GROUP2_INPUT29 */
    12, /* CYHAL_TRIGGER_TR_GROUP2_INPUT30 */
    12, /* CYHAL_TRIGGER_TR_GROUP2_INPUT31 */
    12, /* CYHAL_TRIGGER_TR_GROUP2_INPUT32 */
    13, /* CYHAL_TRIGGER_TR_GROUP2_INPUT33 */
    13, /* CYHAL_TRIGGER_TR_GROUP2_INPUT34 */
    14, /* CYHAL_TRIGGER_TR_GROUP2_INPUT35 */
    14, /* CYHAL_TRIGGER_TR_GROUP2_INPUT36 */
    14, /* CYHAL_TRIGGER_TR_GROUP2_INPUT37 */
    14, /* CYHAL_TRIGGER_TR_GROUP2_INPUT38 */
    14, /* CYHAL_TRIGGER_TR_GROUP2_INPUT39 */
    14, /* CYHAL_TRIGGER_TR_GROUP2_INPUT40 */
    14, /* CYHAL_TRIGGER_TR_GROUP2_INPUT41 */
    14, /* CYHAL_TRIGGER_TR_GROUP2_INPUT42 */
    10, /* CYHAL_TRIGGER_TR_GROUP3_INPUT1 */
    10, /* CYHAL_TRIGGER_TR_GROUP3_INPUT2 */
    10, /* CYHAL_TRIGGER_TR_GROUP3_INPUT3 */
    10, /* CYHAL_TRIGGER_TR_GROUP3_INPUT4 */
    10, /* CYHAL_TRIGGER_TR_GROUP3_INPUT5 */
    10, /* CYHAL_TRIGGER_TR_GROUP3_INPUT6 */
    10, /* CYHAL_TRIGGER_TR_GROUP3_INPUT7 */
    10, /* CYHAL_TRIGGER_TR_GROUP3_INPUT8 */
    11, /* CYHAL_TRIGGER_TR_GROUP3_INPUT9 */
    11, /* CYHAL_TRIGGER_TR_GROUP3_INPUT10 */
    11, /* CYHAL_TRIGGER_TR_GROUP3_INPUT11 */
    11, /* CYHAL_TRIGGER_TR_GROUP3_INPUT12 */
    11, /* CYHAL_TRIGGER_TR_GROUP3_INPUT13 */
    11, /* CYHAL_TRIGGER_TR_GROUP3_INPUT14 */
    11, /* CYHAL_TRIGGER_TR_GROUP3_INPUT15 */
    11, /* CYHAL_TRIGGER_TR_GROUP3_INPUT16 */
    11, /* CYHAL_TRIGGER_TR_GROUP3_INPUT17 */
    11, /* CYHAL_TRIGGER_TR_GROUP3_INPUT18 */
    11, /* CYHAL_TRIGGER_TR_GROUP3_INPUT19 */
    11, /* CYHAL_TRIGGER_TR_GROUP3_INPUT20 */
    11, /* CYHAL_TRIGGER_TR_GROUP3_INPUT21 */
    11, /* CYHAL_TRIGGER_TR_GROUP3_INPUT22 */
    11, /* CYHAL_TRIGGER_TR_GROUP3_INPUT23 */
    11, /* CYHAL_TRIGGER_TR_GROUP3_INPUT24 */
    12, /* CYHAL_TRIGGER_TR_GROUP3_INPUT25 */
    12, /* CYHAL_TRIGGER_TR_GROUP3_INPUT26 */
    12, /* CYHAL_TRIGGER_TR_GROUP3_INPUT27 */
    12, /* CYHAL_TRIGGER_TR_GROUP3_INPUT28 */
    12, /* CYHAL_TRIGGER_TR_GROUP3_INPUT29 */
    12, /* CYHAL_TRIGGER_TR_GROUP3_INPUT30 */
    12, /* CYHAL_TRIGGER_TR_GROUP3_INPUT31 */
    12, /* CYHAL_TRIGGER_TR_GROUP3_INPUT32 */
    13, /* CYHAL_TRIGGER_TR_GROUP3_INPUT33 */
    13, /* CYHAL_TRIGGER_TR_GROUP3_INPUT34 */
    14, /* CYHAL_TRIGGER_TR_GROUP3_INPUT35 */
    14, /* CYHAL_TRIGGER_TR_GROUP3_INPUT36 */
    14, /* CYHAL_TRIGGER_TR_GROUP3_INPUT37 */
    14, /* CYHAL_TRIGGER_TR_GROUP3_INPUT38 */
    14, /* CYHAL_TRIGGER_TR_GROUP3_INPUT39 */
    14, /* CYHAL_TRIGGER_TR_GROUP3_INPUT40 */
    14, /* CYHAL_TRIGGER_TR_GROUP3_INPUT41 */
    14, /* CYHAL_TRIGGER_TR_GROUP3_INPUT42 */
    10, /* CYHAL_TRIGGER_TR_GROUP4_INPUT1 */
    10, /* CYHAL_TRIGGER_TR_GROUP4_INPUT2 */
    10, /* CYHAL_TRIGGER_TR_GROUP4_INPUT3 */
    10, /* CYHAL_TRIGGER_TR_GROUP4_INPUT4 */
    10, /* CYHAL_TRIGGER_TR_GROUP4_INPUT5 */
    10, /* CYHAL_TRIGGER_TR_GROUP4_INPUT6 */
    10, /* CYHAL_TRIGGER_TR_GROUP4_INPUT7 */
    10, /* CYHAL_TRIGGER_TR_GROUP4_INPUT8 */
    11, /* CYHAL_TRIGGER_TR_GROUP4_INPUT9 */
    11, /* CYHAL_TRIGGER_TR_GROUP4_INPUT10 */
    11, /* CYHAL_TRIGGER_TR_GROUP4_INPUT11 */
    11, /* CYHAL_TRIGGER_TR_GROUP4_INPUT12 */
    11, /* CYHAL_TRIGGER_TR_GROUP4_INPUT13 */
    11, /* CYHAL_TRIGGER_TR_GROUP4_INPUT14 */
    11, /* CYHAL_TRIGGER_TR_GROUP4_INPUT15 */
    11, /* CYHAL_TRIGGER_TR_GROUP4_INPUT16 */
    11, /* CYHAL_TRIGGER_TR_GROUP4_INPUT17 */
    11, /* CYHAL_TRIGGER_TR_GROUP4_INPUT18 */
    11, /* CYHAL_TRIGGER_TR_GROUP4_INPUT19 */
    11, /* CYHAL_TRIGGER_TR_GROUP4_INPUT20 */
    11, /* CYHAL_TRIGGER_TR_GROUP4_INPUT21 */
    11, /* CYHAL_TRIGGER_TR_GROUP4_INPUT22 */
    11, /* CYHAL_TRIGGER_TR_GROUP4_INPUT23 */
    11, /* CYHAL_TRIGGER_TR_GROUP4_INPUT24 */
    12, /* CYHAL_TRIGGER_TR_GROUP4_INPUT25 */
    12, /* CYHAL_TRIGGER_TR_GROUP4_INPUT26 */
    12, /* CYHAL_TRIGGER_TR_GROUP4_INPUT27 */
    12, /* CYHAL_TRIGGER_TR_GROUP4_INPUT28 */
    12, /* CYHAL_TRIGGER_TR_GROUP4_INPUT29 */
    12, /* CYHAL_TRIGGER_TR_GROUP4_INPUT30 */
    12, /* CYHAL_TRIGGER_TR_GROUP4_INPUT31 */
    12, /* CYHAL_TRIGGER_TR_GROUP4_INPUT32 */
    13, /* CYHAL_TRIGGER_TR_GROUP4_INPUT33 */
    13, /* CYHAL_TRIGGER_TR_GROUP4_INPUT34 */
    14, /* CYHAL_TRIGGER_TR_GROUP4_INPUT35 */
    14, /* CYHAL_TRIGGER_TR_GROUP4_INPUT36 */
    14, /* CYHAL_TRIGGER_TR_GROUP4_INPUT37 */
    14, /* CYHAL_TRIGGER_TR_GROUP4_INPUT38 */
    14, /* CYHAL_TRIGGER_TR_GROUP4_INPUT39 */
    14, /* CYHAL_TRIGGER_TR_GROUP4_INPUT40 */
    14, /* CYHAL_TRIGGER_TR_GROUP4_INPUT41 */
    14, /* CYHAL_TRIGGER_TR_GROUP4_INPUT42 */
    10, /* CYHAL_TRIGGER_TR_GROUP5_INPUT1 */
    10, /* CYHAL_TRIGGER_TR_GROUP5_INPUT2 */
    10, /* CYHAL_TRIGGER_TR_GROUP5_INPUT3 */
    10, /* CYHAL_TRIGGER_TR_GROUP5_INPUT4 */
    10, /* CYHAL_TRIGGER_TR_GROUP5_INPUT5 */
    10, /* CYHAL_TRIGGER_TR_GROUP5_INPUT6 */
    10, /* CYHAL_TRIGGER_TR_GROUP5_INPUT7 */
    10, /* CYHAL_TRIGGER_TR_GROUP5_INPUT8 */
    11, /* CYHAL_TRIGGER_TR_GROUP5_INPUT9 */
    11, /* CYHAL_TRIGGER_TR_GROUP5_INPUT10 */
    11, /* CYHAL_TRIGGER_TR_GROUP5_INPUT11 */
    11, /* CYHAL_TRIGGER_TR_GROUP5_INPUT12 */
    11, /* CYHAL_TRIGGER_TR_GROUP5_INPUT13 */
    11, /* CYHAL_TRIGGER_TR_GROUP5_INPUT14 */
    11, /* CYHAL_TRIGGER_TR_GROUP5_INPUT15 */
    11, /* CYHAL_TRIGGER_TR_GROUP5_INPUT16 */
    11, /* CYHAL_TRIGGER_TR_GROUP5_INPUT17 */
    11, /* CYHAL_TRIGGER_TR_GROUP5_INPUT18 */
    11, /* CYHAL_TRIGGER_TR_GROUP5_INPUT19 */
    11, /* CYHAL_TRIGGER_TR_GROUP5_INPUT20 */
    11, /* CYHAL_TRIGGER_TR_GROUP5_INPUT21 */
    11, /* CYHAL_TRIGGER_TR_GROUP5_INPUT22 */
    11, /* CYHAL_TRIGGER_TR_GROUP5_INPUT23 */
    11, /* CYHAL_TRIGGER_TR_GROUP5_INPUT24 */
    12, /* CYHAL_TRIGGER_TR_GROUP5_INPUT25 */
    12, /* CYHAL_TRIGGER_TR_GROUP5_INPUT26 */
    12, /* CYHAL_TRIGGER_TR_GROUP5_INPUT27 */
    12, /* CYHAL_TRIGGER_TR_GROUP5_INPUT28 */
    12, /* CYHAL_TRIGGER_TR_GROUP5_INPUT29 */
    12, /* CYHAL_TRIGGER_TR_GROUP5_INPUT30 */
    12, /* CYHAL_TRIGGER_TR_GROUP5_INPUT31 */
    12, /* CYHAL_TRIGGER_TR_GROUP5_INPUT32 */
    13, /* CYHAL_TRIGGER_TR_GROUP5_INPUT33 */
    13, /* CYHAL_TRIGGER_TR_GROUP5_INPUT34 */
    14, /* CYHAL_TRIGGER_TR_GROUP5_INPUT35 */
    14, /* CYHAL_TRIGGER_TR_GROUP5_INPUT36 */
    14, /* CYHAL_TRIGGER_TR_GROUP5_INPUT37 */
    14, /* CYHAL_TRIGGER_TR_GROUP5_INPUT38 */
    14, /* CYHAL_TRIGGER_TR_GROUP5_INPUT39 */
    14, /* CYHAL_TRIGGER_TR_GROUP5_INPUT40 */
    14, /* CYHAL_TRIGGER_TR_GROUP5_INPUT41 */
    14, /* CYHAL_TRIGGER_TR_GROUP5_INPUT42 */
    10, /* CYHAL_TRIGGER_TR_GROUP6_INPUT1 */
    10, /* CYHAL_TRIGGER_TR_GROUP6_INPUT2 */
    10, /* CYHAL_TRIGGER_TR_GROUP6_INPUT3 */
    10, /* CYHAL_TRIGGER_TR_GROUP6_INPUT4 */
    10, /* CYHAL_TRIGGER_TR_GROUP6_INPUT5 */
    10, /* CYHAL_TRIGGER_TR_GROUP6_INPUT6 */
    10, /* CYHAL_TRIGGER_TR_GROUP6_INPUT7 */
    10, /* CYHAL_TRIGGER_TR_GROUP6_INPUT8 */
    11, /* CYHAL_TRIGGER_TR_GROUP6_INPUT9 */
    11, /* CYHAL_TRIGGER_TR_GROUP6_INPUT10 */
    11, /* CYHAL_TRIGGER_TR_GROUP6_INPUT11 */
    11, /* CYHAL_TRIGGER_TR_GROUP6_INPUT12 */
    11, /* CYHAL_TRIGGER_TR_GROUP6_INPUT13 */
    11, /* CYHAL_TRIGGER_TR_GROUP6_INPUT14 */
    11, /* CYHAL_TRIGGER_TR_GROUP6_INPUT15 */
    11, /* CYHAL_TRIGGER_TR_GROUP6_INPUT16 */
    11, /* CYHAL_TRIGGER_TR_GROUP6_INPUT17 */
    11, /* CYHAL_TRIGGER_TR_GROUP6_INPUT18 */
    11, /* CYHAL_TRIGGER_TR_GROUP6_INPUT19 */
    11, /* CYHAL_TRIGGER_TR_GROUP6_INPUT20 */
    11, /* CYHAL_TRIGGER_TR_GROUP6_INPUT21 */
    11, /* CYHAL_TRIGGER_TR_GROUP6_INPUT22 */
    11, /* CYHAL_TRIGGER_TR_GROUP6_INPUT23 */
    11, /* CYHAL_TRIGGER_TR_GROUP6_INPUT24 */
    12, /* CYHAL_TRIGGER_TR_GROUP6_INPUT25 */
    12, /* CYHAL_TRIGGER_TR_GROUP6_INPUT26 */
    12, /* CYHAL_TRIGGER_TR_GROUP6_INPUT27 */
    12, /* CYHAL_TRIGGER_TR_GROUP6_INPUT28 */
    12, /* CYHAL_TRIGGER_TR_GROUP6_INPUT29 */
    12, /* CYHAL_TRIGGER_TR_GROUP6_INPUT30 */
    12, /* CYHAL_TRIGGER_TR_GROUP6_INPUT31 */
    12, /* CYHAL_TRIGGER_TR_GROUP6_INPUT32 */
    13, /* CYHAL_TRIGGER_TR_GROUP6_INPUT33 */
    13, /* CYHAL_TRIGGER_TR_GROUP6_INPUT34 */
    14, /* CYHAL_TRIGGER_TR_GROUP6_INPUT35 */
    14, /* CYHAL_TRIGGER_TR_GROUP6_INPUT36 */
    14, /* CYHAL_TRIGGER_TR_GROUP6_INPUT37 */
    14, /* CYHAL_TRIGGER_TR_GROUP6_INPUT38 */
    14, /* CYHAL_TRIGGER_TR_GROUP6_INPUT39 */
    14, /* CYHAL_TRIGGER_TR_GROUP6_INPUT40 */
    14, /* CYHAL_TRIGGER_TR_GROUP6_INPUT41 */
    14, /* CYHAL_TRIGGER_TR_GROUP6_INPUT42 */
    10, /* CYHAL_TRIGGER_TR_GROUP7_INPUT1 */
    10, /* CYHAL_TRIGGER_TR_GROUP7_INPUT2 */
    10, /* CYHAL_TRIGGER_TR_GROUP7_INPUT3 */
    10, /* CYHAL_TRIGGER_TR_GROUP7_INPUT4 */
    10, /* CYHAL_TRIGGER_TR_GROUP7_INPUT5 */
    10, /* CYHAL_TRIGGER_TR_GROUP7_INPUT6 */
    10, /* CYHAL_TRIGGER_TR_GROUP7_INPUT7 */
    10, /* CYHAL_TRIGGER_TR_GROUP7_INPUT8 */
    11, /* CYHAL_TRIGGER_TR_GROUP7_INPUT9 */
    11, /* CYHAL_TRIGGER_TR_GROUP7_INPUT10 */
    11, /* CYHAL_TRIGGER_TR_GROUP7_INPUT11 */
    11, /* CYHAL_TRIGGER_TR_GROUP7_INPUT12 */
    11, /* CYHAL_TRIGGER_TR_GROUP7_INPUT13 */
    11, /* CYHAL_TRIGGER_TR_GROUP7_INPUT14 */
    11, /* CYHAL_TRIGGER_TR_GROUP7_INPUT15 */
    11, /* CYHAL_TRIGGER_TR_GROUP7_INPUT16 */
    11, /* CYHAL_TRIGGER_TR_GROUP7_INPUT17 */
    11, /* CYHAL_TRIGGER_TR_GROUP7_INPUT18 */
    11, /* CYHAL_TRIGGER_TR_GROUP7_INPUT19 */
    11, /* CYHAL_TRIGGER_TR_GROUP7_INPUT20 */
    11, /* CYHAL_TRIGGER_TR_GROUP7_INPUT21 */
    11, /* CYHAL_TRIGGER_TR_GROUP7_INPUT22 */
    11, /* CYHAL_TRIGGER_TR_GROUP7_INPUT23 */
    11, /* CYHAL_TRIGGER_TR_GROUP7_INPUT24 */
    12, /* CYHAL_TRIGGER_TR_GROUP7_INPUT25 */
    12, /* CYHAL_TRIGGER_TR_GROUP7_INPUT26 */
    12, /* CYHAL_TRIGGER_TR_GROUP7_INPUT27 */
    12, /* CYHAL_TRIGGER_TR_GROUP7_INPUT28 */
    12, /* CYHAL_TRIGGER_TR_GROUP7_INPUT29 */
    12, /* CYHAL_TRIGGER_TR_GROUP7_INPUT30 */
    12, /* CYHAL_TRIGGER_TR_GROUP7_INPUT31 */
    12, /* CYHAL_TRIGGER_TR_GROUP7_INPUT32 */
    13, /* CYHAL_TRIGGER_TR_GROUP7_INPUT33 */
    13, /* CYHAL_TRIGGER_TR_GROUP7_INPUT34 */
    14, /* CYHAL_TRIGGER_TR_GROUP7_INPUT35 */
    14, /* CYHAL_TRIGGER_TR_GROUP7_INPUT36 */
    14, /* CYHAL_TRIGGER_TR_GROUP7_INPUT37 */
    14, /* CYHAL_TRIGGER_TR_GROUP7_INPUT38 */
    14, /* CYHAL_TRIGGER_TR_GROUP7_INPUT39 */
    14, /* CYHAL_TRIGGER_TR_GROUP7_INPUT40 */
    14, /* CYHAL_TRIGGER_TR_GROUP7_INPUT41 */
    14, /* CYHAL_TRIGGER_TR_GROUP7_INPUT42 */
    10, /* CYHAL_TRIGGER_TR_GROUP8_INPUT1 */
    10, /* CYHAL_TRIGGER_TR_GROUP8_INPUT2 */
    10, /* CYHAL_TRIGGER_TR_GROUP8_INPUT3 */
    10, /* CYHAL_TRIGGER_TR_GROUP8_INPUT4 */
    10, /* CYHAL_TRIGGER_TR_GROUP8_INPUT5 */
    10, /* CYHAL_TRIGGER_TR_GROUP8_INPUT6 */
    10, /* CYHAL_TRIGGER_TR_GROUP8_INPUT7 */
    10, /* CYHAL_TRIGGER_TR_GROUP8_INPUT8 */
    11, /* CYHAL_TRIGGER_TR_GROUP8_INPUT9 */
    11, /* CYHAL_TRIGGER_TR_GROUP8_INPUT10 */
    11, /* CYHAL_TRIGGER_TR_GROUP8_INPUT11 */
    11, /* CYHAL_TRIGGER_TR_GROUP8_INPUT12 */
    11, /* CYHAL_TRIGGER_TR_GROUP8_INPUT13 */
    11, /* CYHAL_TRIGGER_TR_GROUP8_INPUT14 */
    11, /* CYHAL_TRIGGER_TR_GROUP8_INPUT15 */
    11, /* CYHAL_TRIGGER_TR_GROUP8_INPUT16 */
    11, /* CYHAL_TRIGGER_TR_GROUP8_INPUT17 */
    11, /* CYHAL_TRIGGER_TR_GROUP8_INPUT18 */
    11, /* CYHAL_TRIGGER_TR_GROUP8_INPUT19 */
    11, /* CYHAL_TRIGGER_TR_GROUP8_INPUT20 */
    11, /* CYHAL_TRIGGER_TR_GROUP8_INPUT21 */
    11, /* CYHAL_TRIGGER_TR_GROUP8_INPUT22 */
    11, /* CYHAL_TRIGGER_TR_GROUP8_INPUT23 */
    11, /* CYHAL_TRIGGER_TR_GROUP8_INPUT24 */
    12, /* CYHAL_TRIGGER_TR_GROUP8_INPUT25 */
    12, /* CYHAL_TRIGGER_TR_GROUP8_INPUT26 */
    12, /* CYHAL_TRIGGER_TR_GROUP8_INPUT27 */
    12, /* CYHAL_TRIGGER_TR_GROUP8_INPUT28 */
    12, /* CYHAL_TRIGGER_TR_GROUP8_INPUT29 */
    12, /* CYHAL_TRIGGER_TR_GROUP8_INPUT30 */
    12, /* CYHAL_TRIGGER_TR_GROUP8_INPUT31 */
    12, /* CYHAL_TRIGGER_TR_GROUP8_INPUT32 */
    13, /* CYHAL_TRIGGER_TR_GROUP8_INPUT33 */
    13, /* CYHAL_TRIGGER_TR_GROUP8_INPUT34 */
    14, /* CYHAL_TRIGGER_TR_GROUP8_INPUT35 */
    14, /* CYHAL_TRIGGER_TR_GROUP8_INPUT36 */
    14, /* CYHAL_TRIGGER_TR_GROUP8_INPUT37 */
    14, /* CYHAL_TRIGGER_TR_GROUP8_INPUT38 */
